app/controllers/posts_controller.rb

	def load_on_show
		if_urlpart_set_instance :blog, :category
		if @category
			#@curr_id = @post.id
			@serial_posts_ids = CategoryPost
				.where(category_id: @category.id)
				.order(:sequence)
				.pluck(:post_id)
			@post_order_index = @serial_posts_ids.index(@post.id)
			if @post_order_index == @serial_posts_ids.length-1
				@prev_post = Post.find(@serial_posts_ids[@serial_posts_ids.length-2])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 16]]